{ "pt":{
    "titles":{
      "experiences":"Experiências",
      "courses":"Cursos",
      "skills":"Habilidades"
    },

    "personalInfo": {
      "name": "Luigi Ribeiro Ferreira",
      "position": "Desenvolvedor"
    },
    "about": {
      "title": "Quem eu sou",
      "description": "Sou um desenvolvedor front-end que adora tudo relacionado à tecnologia. Gosto de trabalhar em equipe e enfrentar desafios de forma criativa. Estou sempre em busca de aprender algo novo e melhorar minhas habilidades. Acredito que o aprendizado nunca acaba, e cada projeto é uma oportunidade para crescer."
    },
    "experiences": [
      
      {
        "company": "Divex",
        "projectName": "Artmed+",
        "description": "Desenvolvo OnePages para cursos de medicina, criando interfaces intuitivas e eficazes. Trabalho em colaboração com a equipe para captar e implementar requisitos específicos e participo ativamente de revisões e feedbacks, sempre buscando aprimorar processos e resultados finais.",
        "imagePath": "assets/Artmed.png"
      },
      {
        "company": "Divex",
        "projectName": "PucRio",
        "description": "Desenvolvi OnePages para cursos da Puc-Rio, onde criei interfaces funcionais e visualmente atraentes. Mantive uma comunicação constante com a equipe da A+, alinhando requisitos, revisões e prazos, e assegurando que cada projeto fosse entregue no prazo e de acordo com altos padrões de qualidade.",
        "imagePath": "assets/Pucrio.png"
      }
    
    ],
    "courses": [
      {
        "institution": "Dio",
        "name": "Formação Scrum Master Certification (Cursando)",
        "description": "Aprendo os fundamentos desse framework leve e adaptativo, utilizado para solucionar problemas complexos de forma iterativa e incremental. O curso aborda a aplicação prática do Scrum na gestão de times e projetos, promovendo aprendizado contínuo, melhoria constante e proximidade com o cliente.",
        "imagePath": "assets/Dio.png"
      },
      {
        "institution": "Estácio",
        "name": "Ciência da computação (Cursando)",
        "description": "Atualmente, estou cursando Ciências da Computação na Estácio, onde estudo desde fundamentos matemáticos até desenvolvimento de softwares para diversas plataformas. O curso abrange programação, banco de dados e sistemas operacionais, preparando-me para criar soluções tecnológicas inovadoras em um mercado de trabalho aquecido e com alta demanda por profissionais qualificados.",
        "imagePath": "assets/Estacio.png"
      },
      {
        "institution": "Dio",
        "name": "Desenvolvimento Front-End com Angular",
        "description": "desenvolvi habilidades na criação de aplicações web modernas e responsivas, estudando conceitos como componentização, SPAs (Single Page Applications), boas práticas de organização e padronização de código. O aprendizado foi reforçado com projetos práticos, desafios de código e mentorias com especialistas do Banco PAN, proporcionando uma experiência alinhada às demandas do mercado.",
        "imagePath": "assets/Dio.png"
      }
      
    ],
    "skills": {
      "titleUiStyling":"Interface e Estilização",
      "uiStyling": ["HTML", "CSS"],
      "titleLogicFunctionality":"Lógica e Funcionalidade",
      "logicFunctionality": ["JavaScript", "TypeScript", "C++", "Node.js"],
      "titleFrameworksLibraries":"Frameworks e Bibliotecas",
      "frameworksLibraries": ["Angular", "React", "Vue.js"],
      "titleCollaborationTools":"Controle de Versão e Colaboração",
      "collaborationTools": ["Git", "GitHub", "Trello", "Slack"],
      "softSkills": ["Trabalho em equipe", "Resolução criativa de problemas", "Dedicação e comprometimento", "Aprendizado rápido de novas tecnologias", "Boa comunicação interpessoal"]
    }
  },
  "en": {
    "titles": {
      "experiences": "Experiences",
      "courses": "Courses",
      "skills": "Skills"
    },

    "personalInfo": {
      "name": "Luigi Ribeiro Ferreira",
      "position": "Developer"
    },
    "about": {
      "title": "Who I Am",
      "description": "I am a front-end developer who loves everything related to technology. I enjoy working in teams and tackling challenges creatively. I'm always looking to learn something new and improve my skills. I believe that learning never ends, and each project is an opportunity to grow."
    },
    "experiences": [
      {
        "company": "Divex",
        "projectName": "Artmed+",
        "description": "I develop OnePages for medical courses, creating intuitive and effective interfaces. I work closely with the team to capture and implement specific requirements and actively participate in reviews and feedback, always striving to improve processes and final results.",
        "imagePath": "assets/Artmed.png"
      },
      {
        "company": "Divex",
        "projectName": "PucRio",
        "description": "I developed OnePages for Puc-Rio courses, creating functional and visually appealing interfaces. I maintained constant communication with the A+ team, aligning requirements, reviews, and deadlines, ensuring each project was delivered on time and met high-quality standards.",
        "imagePath": "assets/Pucrio.png"
      }
    ],
    "courses": [
      {
        "institution": "Dio",
        "name": "Scrum Master Certification Training (In Progress)",
        "description": "I am learning the fundamentals of this lightweight and adaptive framework, used to solve complex problems iteratively and incrementally. The course covers the practical application of Scrum in team and project management, promoting continuous learning, constant improvement, and close customer collaboration.",
        "imagePath": "assets/Dio.png"
      },
      {
        "institution": "Estácio",
        "name": "Computer Science (In Progress)",
        "description": "I am currently studying Computer Science at Estácio, covering everything from mathematical foundations to software development for various platforms. The course includes programming, databases, and operating systems, preparing me to create innovative technological solutions in a growing job market with high demand for skilled professionals.",
        "imagePath": "assets/Estacio.png"
      },
      {
        "institution": "Dio",
        "name": "Front-End Development with Angular",
        "description": "I developed skills in building modern and responsive web applications, studying concepts such as componentization, SPAs (Single Page Applications), best practices in code organization and standardization. The learning process was reinforced with hands-on projects, coding challenges, and mentoring sessions with Banco PAN specialists, providing an experience aligned with market demands.",
        "imagePath": "assets/Dio.png"
      }
    ],
    "skills": {
      "titleUiStyling": "Interface and Styling",
      "uiStyling": ["HTML", "CSS"],
      "titleLogicFunctionality": "Logic and Functionality",
      "logicFunctionality": ["JavaScript", "TypeScript", "C++", "Node.js"],
      "titleFrameworksLibraries": "Frameworks and Libraries",
      "frameworksLibraries": ["Angular", "React", "Vue.js"],
      "titleCollaborationTools": "Version Control and Collaboration",
      "collaborationTools": ["Git", "GitHub", "Trello", "Slack"],
      "softSkills": ["Teamwork", "Creative problem-solving", "Dedication and commitment", "Fast learning of new technologies", "Good interpersonal communication"]
    }
  }
}