
{
    "projects": [
      {
        "type": "project",
        "title": "Bitcoin Bank Dashboard",
        "subtitle": "Plataforma de gestão financeira em Bitcoin",
        "description": "Desenvolvimento de um painel administrativo para um banco que opera com Bitcoin. O projeto consome uma API local para gerenciar usuários e seus dados, além de uma API externa para atualização em tempo real do valor de compra e venda do Bitcoin. A aplicação permite a conversão automática de valores depositados e extraídos das carteiras, possui paginação para gerenciamento eficiente dos dados e funcionalidade de exportação em CSV.",
        "technologies": ["Vue.js", "JavaScript", "Node.js", "CSS"],
        "imagePath": "assets/projects/bitcoin-bank.png",
        "projectLink": "https://github.com/LuigiRibeiroFerreira/desafio-frontend/tree/Luigi-Ribeiro-Ferreira", 
        "codeLink": "#"
      },
      {
        "type": "project",
        "title": "Pokédex React",
        "subtitle": "Enciclopédia interativa de Pokémon",
        "description": "Uma Pokédex completa que consome a API pública de Pokémon, permitindo aos usuários visualizar a lista de Pokémon, adicionar e remover da Pokédex pessoal e acessar detalhes individuais de cada criatura. O projeto inclui transições suaves entre páginas e uma interface intuitiva para facilitar a navegação. Desenvolvido em equipe para garantir uma experiência fluida e interativa.",
        "technologies": ["React", "Styled Components", "REST API", "JavaScript"],
        "imagePath": "assets/pokedex-react.png",
        "projectLink": "https://github.com/future4code/maryam-pokedex11",
        "codeLink": "#"
      },
      {
        "type": "project",
        "title": "4Food: FutureEats",
        "subtitle": "Plataforma de pedidos online",
        "description": "Uma plataforma de delivery semelhante ao iFood, permitindo login de usuários, exibição de cards de restaurantes, edição de perfil e endereço, histórico de compras, carrinho de compras e cadastro de novos usuários.",
        "technologies": ["React.js", "JavaScript", "Styled Components"],
        "imagePath": "assets/future-eats.png",
        "projectLink": "https://github.com/future4code/maryam-labe-food8",
        "codeLink": "#"
      },
      {
        "type": "project",
        "title": "Pokédex Vanilla",
        "subtitle": "Pokédex com foco em estilo",
        "description": "Uma Pokédex interativa que consome a API pública de Pokémon, com foco na apresentação visual e design aprimorado. O projeto oferece uma experiência fluida para consulta e descoberta de Pokémon, utilizando estilização personalizada para uma interface atraente.",
        "technologies": ["JavaScript", "CSS", "HTML"],
        "imagePath": "assets/pokedex-vanilla.png",
        "projectLink": "https://github.com/LuigiRibeiroFerreira/js-developer-pokedex/tree/main",
        "codeLink": "#"
      },
      {
        "type": "project",
        "title": "Snake Game Neon",
        "subtitle": "Jogo da cobrinha com efeitos neon",
        "description": "Uma versão do clássico jogo da cobrinha, com design neon vibrante e mecânicas aprimoradas. O jogo inclui um loop clássico, registro de maior pontuação no localStorage, efeitos visuais como partículas e screenshake ao pontuar, proporcionando uma experiência dinâmica e envolvente.",
        "technologies": ["HTML", "CSS", "JavaScript"],
        "imagePath": "assets/Snake.png",
        "projectLink": "#",
        "codeLink": "#"
      }
    ]
  }