{   
    "titles":{
      "experiences":"Experiências",
      "courses":"Cursos",
      "skills":"Habilidades"
    },

    "personalInfo": {
      "name": "Luigi Ribeiro Ferreira",
      "position": "Desenvolvedor"
    },
    "about": {
      "title": "Quem eu sou",
      "description": "Sou um desenvolvedor front-end que adora tudo relacionado à tecnologia. Gosto de trabalhar em equipe e enfrentar desafios de forma criativa. Estou sempre em busca de aprender algo novo e melhorar minhas habilidades. Acredito que o aprendizado nunca acaba, e cada projeto é uma oportunidade para crescer."
    },
    "experiences": [
      
      {
        "company": "Divex",
        "projectName": "Artmed+",
        "description": "Desenvolvo OnePages para cursos de medicina, criando interfaces intuitivas e eficazes. Trabalho em colaboração com a equipe para captar e implementar requisitos específicos e participo ativamente de revisões e feedbacks, sempre buscando aprimorar processos e resultados finais.",
        "imagePath": "assets/Artmed.png"
      },
      {
        "company": "Divex",
        "projectName": "PucRio",
        "description": "Desenvolvi OnePages para cursos da Puc-Rio, onde criei interfaces funcionais e visualmente atraentes. Mantive uma comunicação constante com a equipe da A+, alinhando requisitos, revisões e prazos, e assegurando que cada projeto fosse entregue no prazo e de acordo com altos padrões de qualidade.",
        "imagePath": "assets/Pucrio.png"
      }
    
    ],
    "courses": [
      {
        "institution": "Dio",
        "name": "Formação Scrum Master Certification (Cursando)",
        "description": "Aprendo os fundamentos desse framework leve e adaptativo, utilizado para solucionar problemas complexos de forma iterativa e incremental. O curso aborda a aplicação prática do Scrum na gestão de times e projetos, promovendo aprendizado contínuo, melhoria constante e proximidade com o cliente.",
        "imagePath": "assets/Dio.png"
      },
      {
        "institution": "Estácio",
        "name": "Ciência da computação (Cursando)",
        "description": "Atualmente, estou cursando Ciências da Computação na Estácio, onde estudo desde fundamentos matemáticos até desenvolvimento de softwares para diversas plataformas. O curso abrange programação, banco de dados e sistemas operacionais, preparando-me para criar soluções tecnológicas inovadoras em um mercado de trabalho aquecido e com alta demanda por profissionais qualificados.",
        "imagePath": "assets/Estacio.png"
      },
      {
        "institution": "Dio",
        "name": "Desenvolvimento Front-End com Angular",
        "description": "desenvolvi habilidades na criação de aplicações web modernas e responsivas, estudando conceitos como componentização, SPAs (Single Page Applications), boas práticas de organização e padronização de código. O aprendizado foi reforçado com projetos práticos, desafios de código e mentorias com especialistas do Banco PAN, proporcionando uma experiência alinhada às demandas do mercado.",
        "imagePath": "assets/Dio.png"
      }
      
    ],
    "skills": {
      "titleUiStyling":"Interface e Estilização",
      "uiStyling": ["HTML", "CSS"],
      "titleLogicFunctionality":"Lógica e Funcionalidade",
      "logicFunctionality": ["JavaScript", "TypeScript", "C++", "Node.js"],
      "titleFrameworksLibraries":"Frameworks e Bibliotecas",
      "frameworksLibraries": ["Angular", "React", "Vue.js"],
      "titleCollaborationTools":"Controle de Versão e Colaboração",
      "collaborationTools": ["Git", "GitHub", "Trello", "Slack"],
      "softSkills": ["Trabalho em equipe", "Resolução criativa de problemas", "Dedicação e comprometimento", "Aprendizado rápido de novas tecnologias", "Boa comunicação interpessoal"]
    }
}